yizushijie/STM32F407ZGT6Project/Application/APP/config.h
#ifndef CONFIG_H_
#define CONFIG_H_
//////////////////////////////////////////////////////////////////////////////////////
#ifdef __cplusplus
extern "C" {
#endif
	//////////////////////////////////////////////////////////////////////////////////////
	//===定义使用的头文件
	#include "complier_lib.h"
	#include "ad5593_task.h"
	#include "adc_task.h"
	#include "ads868x_task.h"
	#include "ads869x_task.h"
	#include "at24cxx_task.h"
	#include "aht10_task.h"
	#include "bkp_task.h"
	#include "crc_task.h"
	#include "css_task.h"
	#include "dac_task.h"
	#include "decode_task.h"
	#include "delay_task.h"
	#include "encode_task.h"
	#include "esp8266_cfg.h"
	#include "exti_task.h"
	#include "gpio_task.h"
	#include "hmc5883_task.h"
	#include "hw_cfg.h"
	#include "hvpp_task.h"
	#include "hvsp_task.h"
	#include "i2c_task.h"
	#include "iap_task.h"
	#include "ina226_task.h"
	#include "isp_task.h"
	#include "iwdg_task.h"
	#include "jtag_task.h"
	#include "key_task.h"
	#include "lcd1602_task.h"
	#include "led_task.h"
	#include "mco_cfg.h"
	#include "max961x_task.h"
	#include "mpu6050_task.h"
	#include "my_malloc.h"
	#include "nrf2401_task.h"
	#include "oled_task.h"
	#include "one_wire_task.h"
	#include "pcf8563_task.h"
	#include "pid_task.h"
	#include "power_task.h"
	#include "random_task.h"
	#include "rfask_task.h"
	#include "rtc_task.h"
	#include "sht2x_task.h"
	#include "si5351a_task.h"
	#include "spi_task.h"
	#include "systick_task.h"
	#include "timer_task.h"
	#include "uart_task.h"
	#include "w25qxx_task.h"
	#include "wm8510_task.h"
	#include "wwdg_task.h"

	#include "data_bus.h"

	//////////////////////////////////////////////////////////////////////////////////////
#ifdef __cplusplus
}
#endif
//////////////////////////////////////////////////////////////////////////////////////
#endif /* CONFIG_H_ */
